// STRANNIK Modula-C-Pascal for Win32
// Demo program
// Demo 1:MessageBox

include Win32

void main() {
    MessageBox(0,"Эмулируем язык 1С ","1C:Предприятие",0|MB_ICONASTERISK);
}

// База знаний программиста
// Идеи распознования и генерации программного кода с 1С на С++ (Странник)

//====================
// ОС(Windows, Win32API)
//====================

//-------------
// From _1C 
//-------------
// Если  <Таймаут>=0
// Предупреждение(<Текст_сообщения>, <Таймаут>) или DoMessageBox(<Текст_сообщения>, <Таймаут>)
// Тогда

//--------------------
// To _CPlusPlus(СТРАННИК Модула-Си-Паскаль)
//--------------------
// 1. Добавить строки "//","//","//"
// 2. Добавить строку "include Win32"
// 3. Добавить строку "void main() {"
// 4. Добавить строку "MessageBox(0,"
// 5. Добавить строку " '"'+<Текст_сообщения>+'"' " 
// 6. Добавть строку ","
// 7. Добавть строку " '"'+<Текст_заголовка>+'"' "
// 8. Добавить строку " ,0|+'MB_ICONASTERISK'); "
// 9. Добавить строку "}"

//----------------
// To _Modula(СТРАННИК Модула-Си-Паскаль)
//----------------
// 1. Добавить строки "//","//","//"
// 2. Добавить строку "module"
// 3. Добавить строку " <Имя_файла_программы>+';' "
// 4. Добавить строку "import Win32;"
// 5. Добавить строку "begin"
// 6. Добавить строку "MessageBox(0,"
// 7. Добавить строку " '"'+<Текст_сообщения>+'"' " 
// 8. Добавть строку ","
// 9. Добавть строку " '"'+<Текст_заголовка>+'"' "
// 10. Добавить строку " ,0|+'MB_ICONASTERISK'); "
// 11. Добавить строку " 'end'+ <Имя_файла_программы>+'.' "

//====================
// ОС(BeOS, WindowsAPI)
//====================

