//Проект Странник-Модула Для Windows 32, тестовая программа
//Группа тестов 2:ПЕРВИЧНОЕ
//Тест номер    7:СТРУКТУРНАЯ КОНСТАНТА

include Win32

char s[15];

typedef
  struct {
    char f1;
    int f2;
    char* f3;
    char f4[11];
  } ЗапТип;

typedef  ЗапТип[1..3] СтруктТип;

define Структ СтруктТип{
  {'a',1,"s1","ss1"},
  {,2,"s2","ss2"},
  {'c',3,"s3","ss3"}
}

//void Проц(ЗапТип пар) {
//  MessageBox(0,пар.f3,'s4',0);
//}

void main() {
  wvsprintf(s,"f2=%li",&(Структ[2].f2));
  MessageBox(0,s,"f2=2",0);

  MessageBox(0,Структ[2].f3,'s2',0);
  MessageBox(0,Структ[2].f4,'ss2',0);

  Структ[2]=ЗапТип{'d',4,"s4",};
  MessageBox(0,Структ[2].f3,'s4',0);

//  Проц(ЗапТип{'d',4,"s4",});
}


